coocox/cox/Holtek/HT32F125x/cmsis_lib/lib/Src/ht32f125x_gptm.c
/*********************************************************************************************************//**
 * @file    ht32f125x_gptm.c
 * @version V1.0
 * @date    04/11/2011
 * @brief   This file provides all the firmware functions about GPTM.
 *************************************************************************************************************
 *
 * <h2><center>Copyright (C) 2011 Holtek Semiconductor Inc. All rights reserved</center></h2>
 *
 ************************************************************************************************************/

/* Includes ------------------------------------------------------------------------------------------------*/
#include "ht32f125x_gptm.h"
#include "ht32f125x_rstcu.h"

/** @addtogroup HT32F125x_Peripheral_Driver HT32F125x Peripheral Driver
  * @{
  */

/** @defgroup  GPTM GPTM
  * @brief GPTM driver modules
  * @{
  */

/** @defgroup GPTM_Private_TypesDefinitions GPTM private types definitions
  * @{
  */
/**
  * @}
  *//* End of GPTM_Private_TypesDefinitions group */

/** @defgroup GPTM_Private_Define GPTM private definitions
  * @{
  */
#define CNTCFR_UEV1DIS      0x01
#define CNTCFR_UGDIS        0x02
#define CNTCFR_DIR          0x01000000
#define CNTCFR_CMSEL_MASK   ~(u32)0x00030000
#define CNTCFR_CKDIV_MASK   ~(u32)0x00000300

#define MDCFR_OPMSET        0x01000000
#define MDCFR_TSE           0x01
#define MDCFR_SMSEL_MASK    ~(u32)0x00000700
#define MDCFR_MMSEL_MASK    ~(u32)0x00070000

#define TRCFR_ECME          0x01000000
#define TRCFR_ETI_POL       0x00010000
#define TRCFR_ETI_PSC_MASK  ~(u32)0x3000
#define TRCFR_ETIF_MASK     ~(u32)0x0F00
#define TRCFR_TRSEL_MASK    ~(u32)0x0F
#define TRCFR_ETI_CONF_MASK ~(u32)0x00013F00

#define CTR_TME             0x01
#define CTR_CRBE            0x02

#define CH0ICFR_CH0SRC      0x80000000
#define CHICFR_CHF_MASK     ~(u32)0x0F
#define CHICFR_CHCCS_MASK   ~(u32)0x00030000
#define CHICFR_CHPSC_MASK   ~(u32)0x000C0000

#define CHOCFR_REFCE        0x08
#define CHOCFR_CHPRE        0x10
#define CHOCFR_IMAE         0x20
#define CHOCFR_CHOM_MASK    ~(u32)0x07

#define CHPOLR_CH0P         0x1
#define CHPOLR_CH1P         0x4
/**
  * @}
  *//* End of GPTM_Private_Define group */

/** @defgroup GPTM_Private_Function_Prototype GPTM private function prototypes
  * @{
  */
static void
gptm_CHx_Config(GPTM_TypeDef* GPTMx, GPTM_CH_Enum Ch, GPTM_CHP_Enum Pol,
                GPTM_CHCCS_Enum Sel, u8 Filter) ;
/**
  * @}
  *//* End of GPTM_Private_Function_Prototype group */

/** @defgroup GPTM_Private_Function GPTM private functions
  * @{
  */

/*********************************************************************************************************//**
 * @brief Deinitialize the GPTMx peripheral registers to their default reset values.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral, x can be 0 or 1.
 * @retval None
 ************************************************************************************************************/
void GPTM_DeInit(GPTM_TypeDef* GPTMx)
{
  /* Check the parameters */
  Assert_Param(IS_GPTM(GPTMx));

  if(GPTMx == GPTM0)
  {
    RSTCU_APBPerip1Reset(RSTCU_APBRST1_GPTM0, ENABLE);
  }
  else if(GPTMx == GPTM1)
  {
    RSTCU_APBPerip1Reset(RSTCU_APBRST1_GPTM1, ENABLE);
  }
}

/*********************************************************************************************************//**
 * @brief Initialize the GPTM counter to reload, prescaler and counter mode.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral, x can be 0 or 1.
 * @param TimeBaseInit: Point to a \ref GPTM_TimeBaseInitTypeDef that contains the configuration information.
 * @retval None
 ************************************************************************************************************/
void GPTM_TimeBaseInit(GPTM_TypeDef* GPTMx, GPTM_TimeBaseInitTypeDef* TimeBaseInit)
{
  /* Check the parameters */
  Assert_Param(IS_GPTM(GPTMx));
  Assert_Param(IS_GPTM_CNT_MODE(TimeBaseInit->CounterMode));
  Assert_Param(IS_GPTM_PSC_RLD(TimeBaseInit->PSCReloadTime));

  /* Set the counter reload value */
  GPTMx->CRR = TimeBaseInit->CounterReload ;

  /* Set the Prescaler value */
  GPTMx->PSCR = TimeBaseInit->Prescaler;

  /* Select the Counter Mode and set the clock division */
  GPTMx->CNTCFR &= CNTCFR_CMSEL_MASK;
  GPTMx->CNTCFR &= ~(u32)CNTCFR_DIR;
  GPTMx->CNTCFR |= (u32)TimeBaseInit->CounterMode ;

  /* To reload the Prescaler value immediatly or next update event 1 */
  GPTMx->EVGR = TimeBaseInit->PSCReloadTime;
}

/*********************************************************************************************************//**
 * @brief Initialize the GPTMx channel x output.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral, x can be 0 or 1.
 * @param OutInit: Point to a \ref GPTM_OutputInitTypeDef structure that contains
                   the configuration information.
 * @retval None
 ************************************************************************************************************/
void GPTM_OutputInit(GPTM_TypeDef* GPTMx, GPTM_OutputInitTypeDef* OutInit)
{
  vu32 *pOcfr = (vu32*)&GPTMx->CH0OCFR + OutInit->Channel;
  vu32 *pCcr = (vu32*)&GPTMx->CH0CCR + OutInit->Channel;
  u8 bChPos = OutInit->Channel << 1;
  u32 wTmpMask = ~((u32)0x1 << bChPos);

  /* Check the parameters */
  Assert_Param(IS_GPTM(GPTMx));
  Assert_Param(IS_GPTM_CH(OutInit->Channel));
  Assert_Param(IS_GPTM_OM(OutInit->OutputMode));
  Assert_Param(IS_GPTM_CHCTL(OutInit->Control));
  Assert_Param(IS_GPTM_CHP(OutInit->Polarity));

  /* Disable the Channel */
  GPTMx->CHCTR &= wTmpMask;

  /* Set the Output Compare Polarity */
  GPTMx->CHPOLR &= wTmpMask;
  GPTMx->CHPOLR |= (u32)OutInit->Polarity << bChPos;

  /* Select the Output Compare Mode */
  *pOcfr &= CHOCFR_CHOM_MASK;
  *pOcfr |= OutInit->OutputMode;

  /* Set the Capture Compare Register value */
  *pCcr = OutInit->Compare;

  /* Set the channel state */
  GPTMx->CHCTR |= (u32)OutInit->Control << bChPos;
}

