coocox/cox/Holtek/HT32F125x/cmsis_lib/lib/Src/ht32f125x_gptm.c
/*********************************************************************************************************//**
 * @brief Configure external clock mode of the GPTM. Used ITIx as the clock source.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral, x can be 0 or 1.
 * @param Iti: Trigger source.
 *        This parameter can be one of the following values:
 *        @arg GPTM_TRSEL_ITI0: Internal trigger 0
 * @retval None
 ************************************************************************************************************/
void GPTM_ItiExternalClockConfig(GPTM_TypeDef* GPTMx, GPTM_TRSEL_Enum Iti)
{
  /* Check the parameters */
  Assert_Param(IS_GPTM(GPTMx));
  Assert_Param(IS_GPTM_ITI(Iti));

  /* Select the Internal Trigger. Slave mode will be disable in this function*/
  GPTM_StiConfig(GPTMx, Iti);

  /* Select the STIED as external clock source */
  GPTMx->MDCFR |= GPTM_SMSEL_STIED;
}

/*********************************************************************************************************//**
 * @brief Configure external clock mode of the GPTM . Used CHx as the clock source.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral, x can be 0 or 1.
 * @param Sel: Specify the channel source.
 *        This parameter can be one of the following values:
 *        @arg GPTM_TRSEL_TI0BED : TI0 both edge detector
 *        @arg GPTM_TRSEL_TI0S0 : Filtered timer input 0
 *        @arg GPTM_TRSEL_TI1S1 : Filtered timer input 1
 * @param Pol: Specify the CHx Polarity.
 *        This parameter can be one of the following values:
 *        @arg GPTM_CHP_NONINVERTED : active high.
 *        @arg GPTM_CHP_INVERTED    : active low.
 * @param Filter: Specify the filter value.
 *        This parameter must be a value between 0x0 and 0xF.
 * @retval None
 ************************************************************************************************************/
void GPTM_ChExternalClockConfig(GPTM_TypeDef* GPTMx, GPTM_TRSEL_Enum Sel, GPTM_CHP_Enum Pol, u8 Filter)
{
  /* Check the parameters */
  Assert_Param(IS_GPTM(GPTMx));
  Assert_Param(IS_GPTM_TRSEL_CH(Sel));
  Assert_Param(IS_GPTM_CHP(Pol));
  Assert_Param(IS_GPTM_FILTER(Filter));

  /* Configure the Timer Input Clock Source */
  if (Sel == GPTM_TRSEL_TI1S1)
  {
    gptm_CHx_Config(GPTMx, GPTM_CH_1, Pol, GPTM_CHCCS_DIRECT, Filter);
  }
  else
  {
    gptm_CHx_Config(GPTMx, GPTM_CH_0, Pol, GPTM_CHCCS_DIRECT, Filter);
  }

  /* Select the external clock source. Slave mode will be disable in this function */
  GPTM_StiConfig(GPTMx, Sel);

  /* Select the STIED as external clock source */
  GPTMx->MDCFR |= GPTM_SMSEL_STIED;
}

/*********************************************************************************************************//**
 * @brief Configure external clock mode of the GPTM. Used ETI as the clock source.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral, x can be 0 or 1.
 * @param Psc: The external Trigger Prescaler.
 *        It can be one of the following values:
 *        @arg GPTM_ETIPSC_OFF : ETI prescaler off
 *        @arg GPTM_ETIPSC_2   : ETIP frequency divided by 2
 *        @arg GPTM_ETIPSC_4   : ETIP frequency divided by 4
 *        @arg GPTM_ETIPSC_8   : ETIP frequency divided by 8
 * @param Pol: The external trigger input polarity.
 *        It can be one of the following values:
 *        @arg GPTM_ETIPOL_NONINVERTED : Active high level or rising edge
 *        @arg GPTM_ETIPOL_INVERTED    : Active low level or falling edge
 * @param Filter: Filter for ETI input.
 *        This parameter must be a value between 0x00 and 0x0F
 * @retval None
 ************************************************************************************************************/
void GPTM_EtiExternalClockConfig(GPTM_TypeDef* GPTMx, GPTM_ETIPSC_Enum Psc, GPTM_ETIPOL_Enum Pol, u8 Filter)
{
  /* Check the parameters */
  Assert_Param(IS_GPTM(GPTMx));
  Assert_Param(IS_GPTM_ETIPSC(Psc));
  Assert_Param(IS_GPTM_ETIPOL(Pol));
  Assert_Param(IS_GPTM_FILTER(Filter));

  /* Configure the ETI Clock source */
  GPTM_EtiConfig(GPTMx, Psc, Pol, Filter);

  /* Enable the external clock mode */
  GPTMx->TRCFR |= TRCFR_ECME;
}

/*********************************************************************************************************//**
 * @brief Configure external trigger input (ETI) of the GPTMx .
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral, x can be 0 or 1.
 * @param Psc: The external Trigger Prescaler.
 *        It can be one of the following values:
 *        @arg GPTM_ETIPSC_OFF : ETI prescaler off
 *        @arg GPTM_ETIPSC_2   : ETIP frequency divided by 2
 *        @arg GPTM_ETIPSC_4   : ETIP frequency divided by 4
 *        @arg GPTM_ETIPSC_8   : ETIP frequency divided by 8
 * @param Pol: The external trigger input polarity.
 *        It can be one of the following values:
 *        @arg GPTM_ETIPOL_NONINVERTED : Active high level or rising edge
 *        @arg GPTM_ETIPOL_INVERTED    : Active low level or falling edge
 * @param Filter: Filter for ETI input.
 *        This parameter must be a value between 0x00 and 0x0F
 * @retval None
 ************************************************************************************************************/
void GPTM_EtiConfig(GPTM_TypeDef* GPTMx, GPTM_ETIPSC_Enum Psc, GPTM_ETIPOL_Enum Pol, u8 Filter)
{
  u32 wTrcfr ;

  /* Check the parameters */
  Assert_Param(IS_GPTM(GPTMx));
  Assert_Param(IS_GPTM_ETIPSC(Psc));
  Assert_Param(IS_GPTM_ETIPOL(Pol));
  Assert_Param(IS_GPTM_FILTER(Filter));

  /* Get TRCFR value with cleared ETI configuration bits */
  wTrcfr = GPTMx->TRCFR & TRCFR_ETI_CONF_MASK;

  /* Set the prescaler, filter and polarity for ETI inpit */
  wTrcfr |= (u32)Psc | Pol | ((u32)Filter << 8);

  /* Write to GPTMx TRCFR */
  GPTMx->TRCFR = wTrcfr;
}

/*********************************************************************************************************//**
 * @brief Configure prescaler of the GPTMx.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral, x can be 0 or 1.
 * @param Psc: Specify the prescaler value.
 * @param PscReloadTime: Specify the GPTM prescaler reload time.
 *        This parameter can be one of the following values:
 *        @arg GPTM_PSC_RLD_UPDATE    : The prescaler is loaded at the next update event 1.
 *        @arg GPTM_PSC_RLD_IMMEDIATE : The prescaler is loaded immediatly.
 * @retval None
 ************************************************************************************************************/
void GPTM_PrescalerConfig(GPTM_TypeDef* GPTMx, u16 Psc, GPTM_PSC_RLD_Enum PscReloadTime)
{
  /* Check the parameters */
  Assert_Param(IS_GPTM(GPTMx));
  Assert_Param(IS_GPTM_PSC_RLD(PscReloadTime));

