coocox/cox/Holtek/HT32F125x/cmsis_lib/lib/Src/ht32f125x_gptm.c
  /* Set the prescaler value */
  GPTMx->PSCR = Psc;

  /* Set the UEV1G bit or not */
  GPTMx->EVGR = PscReloadTime;
}

/*********************************************************************************************************//**
 * @brief Configure counter mode of the GPTMx.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral, x can be 0 or 1.
 * @param Mod: Specify the counter mode to be used.
 *        This parameter can be one of the following values:
 *        @arg GPTM_CNT_MODE_UP   : GPTM up counting mode.
 *        @arg GPTM_CNT_MODE_DOWN : GPTM down counting mode.
 *        @arg GPTM_CNT_MODE_CA1  : GPTM center aligned mode 1.
 *        @arg GPTM_CNT_MODE_CA2  : GPTM center aligned mode 2.
 *        @arg GPTM_CNT_MODE_CA3  : GPTM center aligned mode 3.
 * @retval None
 ************************************************************************************************************/
void GPTM_CounterModeConfig(GPTM_TypeDef* GPTMx, GPTM_CNT_MODE_Enum Mod)
{
  /* Check the parameters */
  Assert_Param(IS_GPTM(GPTMx));
  Assert_Param(IS_GPTM_CNT_MODE(Mod));

  /* Reset the CMSEL and DIR Bits */
  GPTMx->CNTCFR &= CNTCFR_CMSEL_MASK ;
  GPTMx->CNTCFR &= ~(u32)CNTCFR_DIR ;

  /* Set the Counter Mode */
  GPTMx->CNTCFR |= Mod;
}

/*********************************************************************************************************//**
 * @brief Select the STI source.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral, x can be 0 or 1.
 * @param Sel: Store the STI source.
 *        This parameter can be one of the following:
 *        @arg GPTM_TRSEL_ITI0  : Internal trigger 0.
 *        @arg GPTM_TRSEL_TI0BED : TI0 both edge detector.
 *        @arg GPTM_TRSEL_TI0S0 : Filtered channel 0 input.
 *        @arg GPTM_TRSEL_TI1S1 : Filtered channel 1 input.
 *        @arg GPTM_TRSEL_ETIF  : External trigger input.
 *        @arg GPTM_TRSEL_UEV1G : Trigger by setting UEV1G bit.
 * @retval None
 ************************************************************************************************************/
void GPTM_StiConfig(GPTM_TypeDef* GPTMx, GPTM_TRSEL_Enum Sel)
{
  u32 wTrcfr ;

  /* Check the parameters */
  Assert_Param(IS_GPTM(GPTMx));
  Assert_Param(IS_GPTM_TRSEL(Sel));

  /* Disable slave mode */
  GPTMx->MDCFR &= MDCFR_SMSEL_MASK ;

  /* Get the TRCFR value with cleared TRSEL */
  wTrcfr = GPTMx->TRCFR & TRCFR_TRSEL_MASK;

  /* Set the STI source */
  GPTMx->TRCFR |= wTrcfr | Sel;
}

/*********************************************************************************************************//**
 * @brief Configure encoder interface of the GPTMx.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral, x can be 0 or 1.
 * @param DecoderMod: Specify the GPTMx decoder mode.
 *        This parameter can be one of the following values:
 *        @arg GPTM_SMSEL_DECODER1 : Counter counts on CH0 edge depending on CH1 level.
 *        @arg GPTM_SMSEL_DECODER2 : Counter counts on CH1 edge depending on CH0 level.
 *        @arg GPTM_SMSEL_DECODER3 : Counter counts on both CH0 and CH1 edges depending on
 *             the level of the other input.
 * @param CH0P: Specify the CH0 polarity.
 *        This parmeter can be one of the following values:
 *        @arg GPTM_CHP_NONINVERTED : Active high level or rising edge
 *        @arg GPTM_CHP_INVERTED    : Active low level or falling edge
 * @param CH1P: Specify the CH1 polarity.
 *        This parmeter can be one of the following values:
 *        @arg GPTM_CHP_NONINVERTED : Active high level or rising edge
 *        @arg GPTM_CHP_INVERTED    : Active low level or falling edge
 * @retval None
 ************************************************************************************************************/
void GPTM_DecoderConfig(GPTM_TypeDef* GPTMx, GPTM_SMSEL_Enum DecoderMod,
                        GPTM_CHP_Enum CH0P, GPTM_CHP_Enum CH1P)
{
  u32 wMdcfr, wCh0Icfr, wCh1Icfr, wChpolr;

  /* Check the parameters */
  Assert_Param(IS_GPTM(GPTMx));
  Assert_Param(IS_GPTM_SMSEL_DECODER(DecoderMod));
  Assert_Param(IS_GPTM_CHP(CH0P));
  Assert_Param(IS_GPTM_CHP(CH1P));

  /* Get the GPTMx MDCFR register value */
  wMdcfr = GPTMx->MDCFR;

  /* Get the GPTMx CH0ICFR & CH1ICFR register value */
  wCh0Icfr = GPTMx->CH0ICFR;
  wCh1Icfr = GPTMx->CH1ICFR;

  /* Get the GPTMx CHPOLR register value */
  wChpolr = GPTMx->CHPOLR;

  /* Set the decoder mode */
  wMdcfr &= MDCFR_SMSEL_MASK;
  wMdcfr |= DecoderMod;

  /* Select the channel 0 and the channel 1 as input and clear CH0SRC */
  wCh0Icfr &= CHICFR_CHCCS_MASK & (~(u32)CH0ICFR_CH0SRC);
  wCh1Icfr &= CHICFR_CHCCS_MASK;
  wCh0Icfr |= GPTM_CHCCS_DIRECT ;
  wCh1Icfr |= GPTM_CHCCS_DIRECT ;

  /* Set the CH0 and the CH1 polarities */
  wChpolr &= ~((u32)CHPOLR_CH0P | CHPOLR_CH1P);
  wChpolr |= (CH0P | (CH1P << 2));

  /* Write to GPTMx MDCFR */
  GPTMx->MDCFR = wMdcfr;

  /* Write to GPTMx CH0ICFR & CH1ICFR */
  GPTMx->CH0ICFR = wCh0Icfr;
  GPTMx->CH1ICFR = wCh1Icfr;

  /* Write to GPTMx CHPOLR */
  GPTMx->CHPOLR = wChpolr ;
}

/*********************************************************************************************************//**
 * @brief Force CH0OREF waveform of the GPTMx to active or inactive level.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral, x can be 0 or 1.
 * @param ForcedAction: Specify the forced action to be set to the output waveform.
 *        This parameter can be one of the following values:
 *        @arg GPTM_OM_FORCED_ACTIVE   : Forced active level on CH0OREF
 *        @arg GPTM_OM_FORCED_INACTIVE : Forced inactive level on CH0OREF.
 * @retval None
 ************************************************************************************************************/
void GPTM_ForcedOREF0(GPTM_TypeDef* GPTMx, GPTM_OM_Enum ForcedAction)
{
  /* Check the parameters */
  Assert_Param(IS_GPTM(GPTMx));
  Assert_Param(IS_GPTM_OM_FORCED(ForcedAction));

  /* Configure The forced output mode */
  GPTMx->CH0OCFR = (GPTMx->CH0OCFR & CHOCFR_CHOM_MASK) | ForcedAction;
}

