coocox/cox/Holtek/HT32F125x/cmsis_lib/lib/Src/ht32f125x_gptm.c
/*********************************************************************************************************//**
 * @brief Force CH1OREF waveform of the GPTMx to active or inactive level.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral, x can be 0 or 1.
 * @param ForcedAction: Specify the forced action to be set to the output waveform.
 *        This parameter can be one of the following values:
 *        @arg GPTM_OM_FORCED_ACTIVE   : Force active level on CH1OREF
 *        @arg GPTM_OM_FORCED_INACTIVE : Force inactive level on CH1OREF.
 * @retval None
 ************************************************************************************************************/
void GPTM_ForcedOREF1(GPTM_TypeDef* GPTMx, GPTM_OM_Enum ForcedAction)
{
  /* Check the parameters */
  Assert_Param(IS_GPTM(GPTMx));
  Assert_Param(IS_GPTM_OM_FORCED(ForcedAction));

  /* Configure The forced output mode */
  GPTMx->CH1OCFR = (GPTMx->CH1OCFR & CHOCFR_CHOM_MASK) | ForcedAction;
}

/*********************************************************************************************************//**
 * @brief Force CH2OREF waveform of the GPTMx to active or inactive level.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral, x can be 0 or 1.
 * @param ForcedAction: Specify the forced action to be set to the output waveform.
 *        This parameter can be one of the following values:
 *        @arg GPTM_OM_FORCED_ACTIVE   : Force active level on CH2OREF
 *        @arg GPTM_OM_FORCED_INACTIVE : Force inactive level on CH2OREF.
 * @retval None
 ************************************************************************************************************/
void GPTM_ForcedOREF2(GPTM_TypeDef* GPTMx, GPTM_OM_Enum ForcedAction)
{
  /* Check the parameters */
  Assert_Param(IS_GPTM(GPTMx));
  Assert_Param(IS_GPTM_OM_FORCED(ForcedAction));

  /* Configure The forced output mode */
  GPTMx->CH2OCFR = (GPTMx->CH2OCFR & CHOCFR_CHOM_MASK) | ForcedAction;
}

/*********************************************************************************************************//**
 * @brief Force the GPTMx CH3OREF waveform to active or inactive level.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral, x can be 0 or 1.
 * @param ForcedAction: Specify the forced action to be set to the output waveform.
 *        This parameter can be one of the following values:
 *        @arg GPTM_OM_FORCED_ACTIVE   : Force active level on CH3OREF
 *        @arg GPTM_OM_FORCED_INACTIVE : Force inactive level on CH3OREF.
 * @retval None
 ************************************************************************************************************/
void GPTM_ForcedOREF3(GPTM_TypeDef* GPTMx, GPTM_OM_Enum ForcedAction)
{
  /* Check the parameters */
  Assert_Param(IS_GPTM(GPTMx));
  Assert_Param(IS_GPTM_OM_FORCED(ForcedAction));

  /* Configure The forced output mode */
  GPTMx->CH3OCFR = (GPTMx->CH3OCFR & CHOCFR_CHOM_MASK) | ForcedAction;
}

/*********************************************************************************************************//**
 * @brief Enable or Disable GPTM CRR preload function.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral, x can be 0 or 1.
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void GPTM_CRRPreloadCmd(GPTM_TypeDef* GPTMx, ControlStatus NewState)
{
  /* Check the parameters */
  Assert_Param(IS_GPTM(GPTMx));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    /* Set the CRR preload control bit */
    GPTMx->CTR |= CTR_CRBE;
  }
  else
  {
    /* Reset the CRR preload control bit */
    GPTMx->CTR &= ~(u32)CTR_CRBE;
  }
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the GPTM CHxCCR preload function.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral, x can be 0 or 1.
 * @param Channel: Specify the GPTM channel.
 *        This parmeter can be one of the following values:
 *        @arg GPTM_CH_0 : GPTM channel 0
 *        @arg GPTM_CH_1 : GPTM channel 1
 *        @arg GPTM_CH_2 : GPTM channel 2
 *        @arg GPTM_CH_3 : GPTM channel 3
 * @param NewState This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void GPTM_CHCCRPreloadConfig(GPTM_TypeDef* GPTMx, GPTM_CH_Enum Channel, ControlStatus NewState)
{
  vu32 *pOcfr = (vu32*)&GPTMx->CH0OCFR + Channel ;

  /* Check the parameters */
  Assert_Param(IS_GPTM(GPTMx));
  Assert_Param(IS_GPTM_CH(Channel)) ;
  Assert_Param(IS_CONTROL_STATUS(NewState));

  /* Enable or disable the channel x CCR preload feature */
  if(NewState != DISABLE)
  {
    *pOcfr |= CHOCFR_CHPRE;
  }
  else
  {
    *pOcfr &= ~(u32)CHOCFR_CHPRE;
  }
}

/*********************************************************************************************************//**
 * @brief Clear or Safeguards the CHxOREF signal when ETI is active.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral, x can be 0 or 1.
 * @param Channel: Specify the GPTM channel.
 *        This parmeter can be one of the following values:
 *        @arg GPTM_CH_0 : GPTM channel 0
 *        @arg GPTM_CH_1 : GPTM channel 1
 *        @arg GPTM_CH_2 : GPTM channel 2
 *        @arg GPTM_CH_3 : GPTM channel 3
 * @param NewState This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void GPTM_ClearOREFConfig(GPTM_TypeDef* GPTMx, GPTM_CH_Enum Channel, ControlStatus NewState)
{
  vu32 *pOcfr = (vu32*)&GPTMx->CH0OCFR + Channel ;

  /* Check the parameters */
  Assert_Param(IS_GPTM(GPTMx));
  Assert_Param(IS_GPTM_CH(Channel)) ;
  Assert_Param(IS_CONTROL_STATUS(NewState));

  /* Enable or Disable the channel x clear Oref at ETI active function */
  if(NewState != DISABLE)
  {
    *pOcfr |= CHOCFR_REFCE;
  }
  else
  {
    *pOcfr &= ~(u32)CHOCFR_REFCE;
  }
}

