coocox/cox/Holtek/HT32F125x/cmsis_lib/lib/Src/ht32f125x_gptm.c
  /* Reset the CKDIV Bits */
  GPTMx->CNTCFR &= CNTCFR_CKDIV_MASK;

  /* Set the CKDIV value */
  GPTMx->CNTCFR |= Div;
}

/*********************************************************************************************************//**
 * @brief Get channel 0 capture/compare register value of the GPTM.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral, x can be 0 or 1.
 * @return Value of CH0CCR register
 ************************************************************************************************************/
u32 GPTM_GetCaptureCompare0(GPTM_TypeDef* GPTMx)
{
  /* Check the parameters */
  Assert_Param(IS_GPTM(GPTMx));

  /* Get the CH0CCR register value */
  return GPTMx->CH0CCR;
}

/*********************************************************************************************************//**
 * @brief Get channel 1 capture/compare register value of the GPTM.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral, x can be 0 or 1.
 * @return Value of CH1CCR register
 ************************************************************************************************************/
u32 GPTM_GetCaptureCompare1(GPTM_TypeDef* GPTMx)
{
  /* Check the parameters */
  Assert_Param(IS_GPTM(GPTMx));

  /* Get the CH1CCR register value */
  return GPTMx->CH1CCR;
}

/*********************************************************************************************************//**
 * @brief Get channel 2 capture/compare register value of the GPTM.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral, x can be 0 or 1.
 * @return Value of CH2CCR register
 ************************************************************************************************************/
u32 GPTM_GetCaptureCompare2(GPTM_TypeDef* GPTMx)
{
  /* Check the parameters */
  Assert_Param(IS_GPTM(GPTMx));

  /* Get the CH2CCR register value */
  return GPTMx->CH2CCR;
}

/*********************************************************************************************************//**
 * @brief Get channel 3 capture/compare register value of the GPTM.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral, x can be 0 or 1.
 * @return Value of CH3CCR register
 ************************************************************************************************************/
u32 GPTM_GetCaptureCompare3(GPTM_TypeDef* GPTMx)
{
  /* Check the parameters */
  Assert_Param(IS_GPTM(GPTMx));

  /* Get the CH3CCR register value */
  return GPTMx->CH3CCR;
}

/*********************************************************************************************************//**
 * @brief Get counter value of the GPTMx.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral, x can be 0 or 1.
 * @return Value of Counter register
 ************************************************************************************************************/
u32 GPTM_GetCounter(GPTM_TypeDef* GPTMx)
{
  /* Check the parameters */
  Assert_Param(IS_GPTM(GPTMx));

  /* Get the Counter Register value */
  return GPTMx->CNTR;
}

/*********************************************************************************************************//**
 * @brief Get prescaler value of the GPTMx.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral, x can be 0 or 1.
 * @return Value of Prescaler register
 ************************************************************************************************************/
u32 GPTM_GetPrescaler(GPTM_TypeDef* GPTMx)
{
  /* Check the parameters */
  Assert_Param(IS_GPTM(GPTMx));

  /* Get the Prescaler Register value */
  return GPTMx->PSCR;
}

/*********************************************************************************************************//**
 * @brief Generate GPTM events.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral, x can be 0 or 1.
 * @param GPTM_EVENT: Stores the event source.
 *        This parameter can be any combination of following:
 *        @arg GPTM_EVENT_CH0CC     : Timer Capture/compare 0 event
 *        @arg GPTM_EVENT_CH1CC     : Timer Capture/compare 1 event
 *        @arg GPTM_EVENT_CH2CC     : Timer Capture/compare 2 event
 *        @arg GPTM_EVENT_CH3CC     : Timer Capture/compare 3 event
 *        @arg GPTM_EVENT_UEV1      : Timer update event
 *        @arg GPTM_EVENT_TEV       : Timer trigger event
 * @retval None
 ************************************************************************************************************/
void GPTM_GenerateEvent(GPTM_TypeDef* GPTMx, u32 GPTM_EVENT)
{
  /* Check the parameters */
  Assert_Param(IS_GPTM(GPTMx));
  Assert_Param(IS_GPTM_EVENT(GPTM_EVENT));

  /* Set the event sources */
  GPTMx->EVGR = GPTM_EVENT;
}

/*********************************************************************************************************//**
 * @brief Check whether the specified GPTM flag has been set.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral, x can be 0 or 1.
 * @param GPTM_FLAG: Specify the flag to be checked.
 *        This parameter can be one of the following values:
 *        @arg GPTM_FLAG_CH0CC    : GPTM Capture/compare 0 flag
 *        @arg GPTM_FLAG_CH1CC    : GPTM Capture/compare 1 flag
 *        @arg GPTM_FLAG_CH2CC    : GPTM Capture/compare 2 flag
 *        @arg GPTM_FLAG_CH3CC    : GPTM Capture/compare 3 flag
 *        @arg GPTM_FLAG_CH0OC    : GPTM channel 0 overcapture flag
 *        @arg GPTM_FLAG_CH1OC    : GPTM channel 1 overcapture flag
 *        @arg GPTM_FLAG_CH2OC    : GPTM channel 2 overcapture flag
 *        @arg GPTM_FLAG_CH3OC    : GPTM channel 3 overcapture flag
 *        @arg GPTM_FLAG_UEV1     : GPTM update flag
 *        @arg GPTM_FLAG_TEV      : GPTM trigger flag
 * @return The new state of GPTM_FLAG (SET or RESET).
 ************************************************************************************************************/
FlagStatus GPTM_GetFlagStatus(GPTM_TypeDef* GPTMx, u32 GPTM_FLAG)
{
  /* Check the parameters */
  Assert_Param(IS_GPTM(GPTMx));
  Assert_Param(IS_GPTM_FLAG(GPTM_FLAG));

  if ((GPTMx->INTSR & GPTM_FLAG) != 0)
  {
    return SET;
  }
  else
  {
    return RESET;
  }
}

