coocox/cox/Holtek/HT32F125x/cmsis_lib/lib/Src/ht32f125x_gptm.c
/*********************************************************************************************************//**
 * @brief Clear flags of the GPTMx.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral, x can be 0 or 1.
 * @param GPTM_FLAG: Specify the flag to be cleared.
 *        This parameter can be any combination of the following values:
 *        @arg GPTM_FLAG_CH0CC    : GPTM Capture/compare 0 flag
 *        @arg GPTM_FLAG_CH1CC    : GPTM Capture/compare 1 flag
 *        @arg GPTM_FLAG_CH2CC    : GPTM Capture/compare 2 flag
 *        @arg GPTM_FLAG_CH3CC    : GPTM Capture/compare 3 flag
 *        @arg GPTM_FLAG_CH0OC    : GPTM channel 0 overcapture flag
 *        @arg GPTM_FLAG_CH1OC    : GPTM channel 1 overcapture flag
 *        @arg GPTM_FLAG_CH2OC    : GPTM channel 2 overcapture flag
 *        @arg GPTM_FLAG_CH3OC    : GPTM channel 3 overcapture flag
 *        @arg GPTM_FLAG_UEV1     : GPTM update flag
 *        @arg GPTM_FLAG_TEV      : GPTM trigger flag
 * @retval None
 ************************************************************************************************************/
void GPTM_ClearFlag(GPTM_TypeDef* GPTMx, u32 GPTM_FLAG)
{
  /* Check the parameters */
  Assert_Param(IS_GPTM(GPTMx));
  Assert_Param(IS_GPTM_FLAG_CLR(GPTM_FLAG));

  /* Clear the flags */
  GPTMx->INTSR = ~GPTM_FLAG;
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the specified interrupts of the GPTM.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral, x can be 0 or 1.
 * @param GPTM_INT: Specify the GPTM interrupts sources to be enabled or disabled.
 *        This parameter can be any combination of the following values:
 *        @arg GPTM_INT_CH0CC     : GPTM Capture/compare 0 interrupt
 *        @arg GPTM_INT_CH1CC     : GPTM Capture/compare 1 interrupt
 *        @arg GPTM_INT_CH2CC     : GPTM Capture/compare 2 interrupt
 *        @arg GPTM_INT_CH3CC     : GPTM Capture/compare 3 interrupt
 *        @arg GPTM_INT_UEV1      : GPTM update interrupt
 *        @arg GPTM_INT_TEV       : GPTM trigger interrupt
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void GPTM_IntConfig(GPTM_TypeDef* GPTMx, u32 GPTM_INT, ControlStatus NewState)
{
  /* Check the parameters */
  Assert_Param(IS_GPTM(GPTMx));
  Assert_Param(IS_GPTM_INT(GPTM_INT));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    /* Enable the interrupt sources */
    GPTMx->ICTR |= GPTM_INT;
  }
  else
  {
    /* Disable the interrupt sources */
    GPTMx->ICTR &= ~GPTM_INT;
  }
}

/*********************************************************************************************************//**
 * @brief Check whether the GPTM interrupt has occurred.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral, x can be 0 or 1.
 * @param GPTM_INT: Specify the GPTM interrupt source to be checked.
 *        This parameter can be one of the following values:
 *        @arg GPTM_INT_CH0CC     : GPTM Capture/compare 0 interrupt
 *        @arg GPTM_INT_CH1CC     : GPTM Capture/compare 1 interrupt
 *        @arg GPTM_INT_CH2CC     : GPTM Capture/compare 2 interrupt
 *        @arg GPTM_INT_CH3CC     : GPTM Capture/compare 3 interrupt
 *        @arg GPTM_INT_UEV1      : GPTM update interrupt
 *        @arg GPTM_INT_TEV       : GPTM trigger interrupt
 * @return The new state of the GPTM_INT(SET or RESET)
 ************************************************************************************************************/
FlagStatus GPTM_GetIntStatus(GPTM_TypeDef* GPTMx, u32 GPTM_INT)
{
  u32 itstatus, itenable ;

  /* Check the parameters */
  Assert_Param(IS_GPTM(GPTMx));
  Assert_Param(IS_GPTM_GET_INT(GPTM_INT));

  itstatus = GPTMx->INTSR & GPTM_INT;
  itenable = GPTMx->ICTR & GPTM_INT;

  if ((itstatus != 0) && (itenable != 0))
  {
    return SET;
  }
  else
  {
    return RESET;
  }
}

/*********************************************************************************************************//**
 * @brief Clear interrupt pending bits of the GPTMx.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral, x can be 0 or 1.
 * @param GPTM_INT: Specify the GPTM interrupt to be cleared.
 *        This parameter can be any combination of the following values:
 *        @arg GPTM_INT_CH0CC     : GPTM Capture/compare 0 interrupt
 *        @arg GPTM_INT_CH1CC     : GPTM Capture/compare 1 interrupt
 *        @arg GPTM_INT_CH2CC     : GPTM Capture/compare 2 interrupt
 *        @arg GPTM_INT_CH3CC     : GPTM Capture/compare 3 interrupt
 *        @arg GPTM_INT_UEV1      : GPTM update interrupt
 *        @arg GPTM_INT_TEV       : GPTM trigger interrupt
 * @retval None
 ************************************************************************************************************/
void GPTM_ClearIntPendingBit(GPTM_TypeDef* GPTMx, u32 GPTM_INT)
{
  /* Check the parameters */
  Assert_Param(IS_GPTM(GPTMx));
  Assert_Param(IS_GPTM_INT(GPTM_INT));

  /* Clear the interrupt pending Bit */
  GPTMx->INTSR = ~GPTM_INT;
}

/*********************************************************************************************************//**
 * @brief Disable slave mode to clock the prescaler directly with the internal clock.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral, x can be 0 or 1.
 * @retval None
 ************************************************************************************************************/
void GPTM_InternalClockConfig(GPTM_TypeDef* GPTMx)
{
  /* Check the parameters */
  Assert_Param(IS_GPTM(GPTMx));

  /* Disable slave mode to clock the prescaler directly with the internal clock */
  GPTMx->MDCFR &=  MDCFR_SMSEL_MASK;
}



/*********************************************************************************************************//**
 * @brief Configure the CHx as input.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral, x can be 0 or 1.
 * @param Ch Specify the GPTM Channel.
 *        This parmeter can be one of the following values:
 *        @arg GPTM_CH_0 : GPTM channel 0
 *        @arg GPTM_CH_1 : GPTM channel 1
 *        @arg GPTM_CH_2 : GPTM channel 2
 *        @arg GPTM_CH_3 : GPTM channel 3
 * @param Pol: The input polarity.
 *        This parameter can be one of the following values:
 *        @arg GPTM_CHP_NONINVERTED : Active high level or rising edge
 *        @arg GPTM_CHP_INVERTED    : Active low level or falling edge
 * @param Sel: Specify the input to be used.
 *        This parameter can be one of the following values:
 *        @arg GPTM_CHCCS_DIRECT   : GPTM CHxI is mapped on CHx.
 *        @arg GPTM_CHCCS_INDIRECT : GPTM CH1I is mapped on CH0 (or CH0I->CH1 or CH2I->CH3 or CH3I->CH2).
 *        @arg GPTM_CHCCS_TRCED    : GPTM CHx is mapped on TRC.
 * @param Filter: Specify the input capture filter.
 *        This parameter must be a value between 0x00 and 0x0F.
 * @retval None
 ************************************************************************************************************/
static void
gptm_CHx_Config(GPTM_TypeDef* GPTMx, GPTM_CH_Enum Ch, GPTM_CHP_Enum Pol, GPTM_CHCCS_Enum Sel, u8 Filter)
{
  vu32* pIcfr = (vu32*)&GPTMx->CH0ICFR + Ch ;
  u32 wIcfr, wChpolr;

  /* Disable the channel x: reset the CHxE bit */
  GPTMx->CHCTR &= ~((u32)0x1 << (Ch << 1)) ;

  wIcfr = *pIcfr;
  wChpolr = GPTMx->CHPOLR;

  /* Select the input and set the filter */
  wIcfr &= CHICFR_CHCCS_MASK & CHICFR_CHF_MASK;
  wIcfr |= Sel | Filter;
  *pIcfr = wIcfr;

  /* Select the polarity bit */
  wChpolr &= ~((u32)0x1 << (Ch << 1));
  wChpolr |= (u32)Pol << (Ch << 1);
  GPTMx->CHPOLR = wChpolr;

  /* Set the CHxE Bit */
  GPTMx->CHCTR |= (u32)0x1 << (Ch << 1) ;
}

/**
  * @}
  *//* End of GPTM_Private_Function group */

/**
  * @}
  *//* End of GPTM group */

/**
  * @}
  *//* End of HT32F125x_Peripheral_Driver group */
